texts = {
    "YASH1": [
        "सागर ज्योतिष नौकरीधंदा,",
        "प्रेमविवाह, शत्रुनाश, गुप्तसमस्या,",
        "वशीकरण यंत्र, जन्मकुंडली",
        ": 9870126299 नवी मुंबई"
    ],
    "YASH2": [
        "भिवंडीमें नामांकित ट्रान्सपोर्ट कं.",
        "के लिए लोडींग अनलोडींग क्लर्क",
        "एवं डिलिव्हरी बॉईज - तथा LPT",
        "-407-1109 केलिए ड्राइवर चाहिए।",
        "मो : 9324606851, 9324606650"
    ],
    "YASH3": [
        "गोरेगाव (पश्चिम) में पार्ले बिस्किट",
        "के लिए डिलिवरी बॉय कम",
        "लोडरकी आवश्यकता है। SSC",
        "पास, उम्र 18 से 35 साल गोरेगावमें",
        "रहनेवालों को प्राथमिकता दी",
        "जाएगी। संपर्क : 9820254124"
    ],
    "YASH4": [
        "घर बैठे दोना-पत्तल (पेपर डिश)",
        "बनाएं। महीना 30 - 35 हजार कमाएं।",
        "दो साल का एग्रीमेंट 9028160157"
    ],
    "YASH5": [
        "मुंबई स्मार्ट मीटर प्रोजेक्ट हेतू",
        "इलेक्ट्रिकल वायरमैन व सुपरवाइजर",
        "की आवश्यकता। वेतन 15000-",
        "20000 (परक्राम्य) प्रशिक्षण उपलब्ध।",
        "प्रोत्साहन एवं करियर विकास के",
        "अवसर संपर्क: +91 8582945474"
    ]
}

for k, lines in texts.items():
    print(f"\n{k}:")
    for l in lines:
        print(f"  [{len(l)}] {l}")
